Infineon/XMC-for-Arduino/arm/variants/XMC4700/config/XMC4700_Relax_Kit/pins_arduino.h
/*
  pins_arduino.h - Pin definition functions for Arduino
  Part of Arduino - http://www.arduino.cc/

  Copyright (c) 2007 David A. Mellis

  This library is free software; you can redistribute it and/or
  modify it under the terms of the GNU Lesser General Public
  License as published by the Free Software Foundation; either
  version 2.1 of the License, or (at your option) any later version.

  This library is distributed in the hope that it will be useful,
  but WITHOUT ANY WARRANTY; without even the implied warranty of
  MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the GNU
  Lesser General Public License for more details.

  You should have received a copy of the GNU Lesser General
  Public License along with this library; if not, write to the
  Free Software Foundation, Inc., 59 Temple Place, Suite 330,
  Boston, MA  02111-1307  USA
  
  Copyright (c) 2018 Infineon Technologies AG
  This file has been modified for the XMC microcontroller series.
*/

#ifndef PINS_ARDUINO_H_
#define PINS_ARDUINO_H_

//****************************************************************************
// @Project Includes
//****************************************************************************
#include <XMC4700.h>

//****************************************************************************
// @Defines
//****************************************************************************
#define XMC_BOARD           XMC4700_Relax_Kit

//#define NUM_DIGITAL_PINS    98
#define NUM_ANALOG_INPUTS   22
#define NUM_PWM             23
#define NUM_LEDS            2
#define NUM_INTERRUPT       2
#define NUM_SERIAL          2
#define NUM_TONE_PINS       16
#define NUM_TASKS_VARIANT   32

// Board has two serial ports pre-assigned to debug and on-board

#define PWM4_TIMER_PERIOD (0x11EF)  // Generate 490Hz @fCCU=144MHz
#define PWM8_TIMER_PERIOD (0x11EF)  // Generate 490Hz @fCCU=144MHz

#define PCLK 144000000u

#define PIN_SPI_SS    10
#define PIN_SPI_MOSI  11
#define PIN_SPI_MISO  12
#define PIN_SPI_SCK   13

#define PIN_SPI_SS_SD    28
#define PIN_SPI_MOSI_SD  29
#define PIN_SPI_MISO_SD  30
#define PIN_SPI_SCK_SD   31

#define A0   0
#define A1   1
#define A2   2
#define A3   3
#define A4   4
#define A5   5
//Additional ADC ports starting here
#define A6	 6		// ADC G2CH6 on P15.6
#define A7	 7		// ADC G2CH5 on P15.5
#define A8	 8		// ADC G2CH3 on P15.3
#define A9	 9		// ADC G1CH7 on P14.15
#define A10	 10		// ADC G1CH5 on P14.13
#define A11	 11		// ADC G0CH7 on P14.7
#define A12	 12		// ADC G3CH7 on P15.15
#define A13	 13		// ADC G1CH1 on P14.9
#define A14	 14		// ADC G1CH0 on P14.8
#define A15	 15		// ADC G3CH6 on P15.14
#define A16	 16		// ADC G0CH6 on P14.6
#define A17	 17		// ADC G1CH4 on P14.12
#define A18	 18		// ADC G1CH6 on P14.14
#define A19	 19		// ADC G2CH2 on P15.2
#define A20	 20		// ADC G2CH4 on P15.4
#define A21	 21		// ADC G2CH7 on P15.7
// ADC G3CH0 on P15.8	not available
// ADC G3CH1 on P15.9	not available
// ADC G3CH4 on P15.12	button
// ADC G3CH5 on P15.13	button


#define LED_BUILTIN 24  //Standard Arduino LED: Used LED1
#define LED1        24  // Additional LED1
#define LED2        25  // Additional LED2
#define BUTTON1     26  // Additional BUTTON1
#define BUTTON2     27  // Additional BUTTON2
#define GND         50  // GND

#define digitalPinToInterrupt(p)    ((p) == 2 ? 0 : ((p) == 3 ? 1 : NOT_AN_INTERRUPT))

#ifdef ARDUINO_MAIN
/* Mapping of Arduino Pins to PWM4 channels as pin and PWM4 channel
   last entry 255 for both parts.
   Putting both parts in array means if a PWM4 channel gets reassigned for
   another function later a gap in channel numbers will not mess things up */
const uint8_t mapping_pin_PWM4[][ 2 ] = {
                                        { 3, 0 },
                                        { 10, 1 },
                                        { 11, 2 },
                                        { 95, 3 },
                                        { 72, 4 },
                                        { 96, 5 },
                                        { 63, 6 },
                                        { 36, 7 },
                                        { 78, 8 },
                                        { 90, 9 },
                                        { 91, 10 },
                                        { 255, 255 } };
const uint8_t mapping_pin_PWM8[][ 2 ] = {
                                        { 5, 0 },
                                        { 6, 1 },
                                        { 9, 2 },
                                        { 53, 3 },
                                        { 39, 4 },
                                        { 64, 5 },
                                        { 38, 6 },
                                        { 68, 7 },
                                        { 79, 8 },
                                        { 83, 9 },
                                        { 82, 10 },
                                        { 81, 11 },
                                        { 255, 255 } };
const uint8_t mapping_pin_DAC[][ 2 ] = {
                                        { 50, 0 },
                                        { 55, 1 },
                                        { 255, 255 } };

const XMC_PORT_PIN_t mapping_port_pin[] =
{
    /* 0  */    {XMC_GPIO_PORT2, 15},   // RX                           P2.15
    /* 1  */    {XMC_GPIO_PORT2 , 14},  // TX                           P2.14
    /* 2  */    {XMC_GPIO_PORT1 , 0},   // GPIO / External INT 0        P1.0
    /* 3  */    {XMC_GPIO_PORT1 , 1},   // PWM40-2 / External INT 1     P1.1
    /* 4  */    {XMC_GPIO_PORT1 , 8},   // GPIO                         P1.8
    /* 5  */    {XMC_GPIO_PORT2 , 12},  // PWM81-3 output               P2.12
    /* 6  */    {XMC_GPIO_PORT2 , 11},  // PWM80-2 output               P2.11
    /* 7  */    {XMC_GPIO_PORT1 , 9},   // GPIO                         P1.9
    /* 8  */    {XMC_GPIO_PORT1 , 10},  // GPIO                         P1.10
    /* 9  */    {XMC_GPIO_PORT1 , 11},  // PWM81-1 output               P1.11
    /* 10  */   {XMC_GPIO_PORT3 , 10},  // SPI-SS / PWM41-0 output      P3.10
    /* 11  */   {XMC_GPIO_PORT3 , 8},   // SPI-MOSI / PWM41-2 output    P3.8
    /* 12  */   {XMC_GPIO_PORT3 , 7},   // SPI-MISO                     P3.7
    /* 13  */   {XMC_GPIO_PORT3 , 9},   // SPI-SCK                      P3.9
    /* 14  */   {XMC_GPIO_PORT2 , 3},   // AREF TODO:                   P2.3
    /* 15  */   {XMC_GPIO_PORT3 , 15},  // I2C Data / Address SDA       P3.15
    /* 16  */   {XMC_GPIO_PORT0 , 13},  // I2C Clock SCL                P0.13
    /* 17  */   {XMC_GPIO_PORT14 , 0},  // A0 / ADC Input               P14.0 (INPUT ONLY)
    /* 18  */   {XMC_GPIO_PORT14 , 1},  // A1 / ADC Input               P14.1 (INPUT ONLY)
    /* 19  */   {XMC_GPIO_PORT14 , 2},  // A2 / ADC Input               P14.2 (INPUT ONLY)
    /* 20  */   {XMC_GPIO_PORT14 , 3},  // A3 / ADC Input               P14.3 (INPUT ONLY)
    /* 21  */   {XMC_GPIO_PORT14 , 4},  // A4 / ADC Input               P14.4 (INPUT ONLY)
    /* 22  */   {XMC_GPIO_PORT14 , 5},  // A5 / ADC Input               P14.5 (INPUT ONLY)
    /* 23  */   {XMC_GPIO_PORT3 , 12},  // SPI_SS_2                     P3.12
    /* 24  */   {XMC_GPIO_PORT5 , 9},   // Additional LED1              P5.9
    /* 25  */   {XMC_GPIO_PORT5 , 8},   // Additional LED2              P5.8
    /* 26  */   {XMC_GPIO_PORT15 , 13}, // Additional BUTTON1           P15.13 (INPUT ONLY)
    /* 27  */   {XMC_GPIO_PORT15 , 12}, // Additional BUTTON2           P15.12 (INPUT ONLY)
    /* 28  */   {XMC_GPIO_PORT4 , 1},   // SPI_SS_3 (SD CARD)           P4.1
    /* 29  */   {XMC_GPIO_PORT3 , 5},   // SPI-MOSI (SD CARD)           P3.5
    /* 30  */   {XMC_GPIO_PORT4 , 0},   // SPI-MISO (SD CARD)           P4.0
    /* 31  */   {XMC_GPIO_PORT3 , 6},   // SPI-SCK  (SD CARD)           P3.6
    /* 32  */   {XMC_GPIO_PORT1 , 6},   //                              P1.6
    /* 33  */   {XMC_GPIO_PORT1 , 7},   //                              P1.7
    /* 34  */   {XMC_GPIO_PORT1 , 4},   // USB Debug RX                 P1.4
    /* 35  */   {XMC_GPIO_PORT1 , 5},   // USB Debug TX                 P1.5

